Project/Toir/src/Enums/РеквизитыКлассаНоменклатуры/РеквизитыКлассаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыКлассаНоменклатуры</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Статус</name>
  </enumValues>
  <enumValues>
    <name>Родитель</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РеквизитыКлассаНоменклатуры/ManagerModule.bsl
Функция ПолучитьМетаданныеРеквизита(МетаданныеСпр, ЗначениеПеречисления) Экспорт
	
	ИндексЭлементаПеречисления = Перечисления.РеквизитыКлассаНоменклатуры.Индекс(ЗначениеПеречисления);
	МетаданныеЭлементаПеречисления = Метаданные.Перечисления.РеквизитыКлассаНоменклатуры.ЗначенияПеречисления.Получить(ИндексЭлементаПеречисления);
	Если НЕ МетаданныеСпр = Неопределено Тогда
		Если ЭтоСтандартныйРеквизит(ЗначениеПеречисления) Тогда
			РеквизитСпр = МетаданныеСпр.СтандартныеРеквизиты[МетаданныеЭлементаПеречисления.Имя];
		Иначе
			РеквизитСпр = МетаданныеСпр.Реквизиты.Найти(МетаданныеЭлементаПеречисления.Имя);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитСпр;
	
КонецФункции

Функция ЭтоСтандартныйРеквизит(ЗначениеПеречисления) Экспорт
	
	Результат = Ложь;
	Если ЗначениеПеречисления = Перечисления.РеквизитыКлассаНоменклатуры.Код 
			ИЛИ ЗначениеПеречисления = Перечисления.РеквизитыКлассаНоменклатуры.Родитель 
		Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
